Frame/Content.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-07-04 Sat 23:33 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Contents</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Comcx" />
<link rel="stylesheet" type="text/css" href="../Note/org-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../Note/org-themes/styles/readtheorg/css/readtheorg.css"/>
<link rel="icon" type="../image/x-icon" href="images/digimon-icon.png" />
</head>
<body>
<div id="content">
<h1 class="title">Contents</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org77ba1c3">1. Articles</a>
<ul>
<li><a href="#orgc314a5e">1.1. From Recursion to Greedy algorithms: a functional perspective</a></li>
<li><a href="#org2de8259">1.2. IO Monad in JavaScript!</a></li>
<li><a href="#org76e126a">1.3. Sorting algorithms revisited</a></li>
<li><a href="#org49ca0cb">1.4. Learning Functional Programming by Parser Combinators!</a></li>
<li><a href="#org81946b3">1.5. Haskell Show Instance Overlapping Problem</a></li>
<li><a href="#orgbb5b589">1.6. Codewars | Number of Proper Fractions with Denominator d</a></li>
<li><a href="#org52cf2aa">1.7. Prime Factorization</a></li>
<li><a href="#orgab10a1a">1.8. Tail recursion optimization translation</a></li>
<li><a href="#org8dfe619">1.9. 从零开始的Agda生活</a></li>
<li><a href="#org810b11f">1.10. MIT6.828 Lab1 </a></li>
<li><a href="#orgadc0e02">1.11. MIT6.828 HW Shell</a></li>
<li><a href="#org9895833">1.12. MIT6.828 Lab2</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-org77ba1c3" class="outline-2">
<h2 id="org77ba1c3"><span class="section-number-2">1</span> Articles</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgc314a5e" class="outline-3">
<h3 id="orgc314a5e"><span class="section-number-3">1.1</span> <a href="../Note/FromRecursionToGreedy.html">From Recursion to Greedy algorithms: a functional perspective</a></h3>
<div class="outline-text-3" id="text-1-1">
<p>
<b>2020.01.24</b><br />
There's an important leanring and developing chain of traditional algorithms:
<code>Divide and Conquer(recursion) ---&gt; Dynamic Programming(mermorization) --&gt; Greedy</code> 
</p>
</div>
</div>

<div id="outline-container-org2de8259" class="outline-3">
<h3 id="org2de8259"><span class="section-number-3">1.2</span> <a href="../Note/IOMonadInJavaScript.html">IO Monad in JavaScript!</a></h3>
<div class="outline-text-3" id="text-1-2">
<p>
<b>2020.01.27</b><br />
Monad &gt;&gt;= \m =&gt; interesting, right?
</p>
</div>
</div>

<div id="outline-container-org76e126a" class="outline-3">
<h3 id="org76e126a"><span class="section-number-3">1.3</span> <a href="../Note/SortingAlgorithmsRevisited.html">Sorting algorithms revisited</a></h3>
<div class="outline-text-3" id="text-1-3">
<p>
<b>2020.01.29</b><br />
We're going to revisite some main-stream sorting algorithms and
try to implement them in a more efficient way.
</p>

<p>
To make things simple, we choose <span class="underline">Haskell</span> to describe basic recursions and
ideas, then we directly translate haskell codes into <span class="underline">Scala</span> since Scala serves
a great role between purely functional way and more traditional ways.
</p>

<p>
Finally, we translate Scala codes into <span class="underline">C++</span> (some even C:).
</p>
</div>
</div>

<div id="outline-container-org49ca0cb" class="outline-3">
<h3 id="org49ca0cb"><span class="section-number-3">1.4</span> <a href="../Note/LearningFPByParserCombinators.html">Learning Functional Programming by Parser Combinators!</a></h3>
<div class="outline-text-3" id="text-1-4">
<p>
<b>2020.01.30</b><br />
</p>
</div>
</div>

<div id="outline-container-org81946b3" class="outline-3">
<h3 id="org81946b3"><span class="section-number-3">1.5</span> <a href="../Note/HaskellShowInstanceOverlappingProblem.html">Haskell Show Instance Overlapping Problem</a></h3>
<div class="outline-text-3" id="text-1-5">
<p>
<b>2020.02.02</b><br />
Same question encountered when I designed <i>Nona</i>&#x2026;
</p>
</div>
</div>

<div id="outline-container-orgbb5b589" class="outline-3">
<h3 id="orgbb5b589"><span class="section-number-3">1.6</span> <a href="../Note/NumberOfProperFractionsWithDenominator.html">Codewars | Number of Proper Fractions with Denominator d</a></h3>
<div class="outline-text-3" id="text-1-6">
<p>
<b>2020.02.23</b><br />
(Euler's totient function :-)
</p>
</div>
</div>

<div id="outline-container-org52cf2aa" class="outline-3">
<h3 id="org52cf2aa"><span class="section-number-3">1.7</span> <a href="../Note/PrimeFactorization.html">Prime Factorization</a></h3>
<div class="outline-text-3" id="text-1-7">
<p>
<b>2020.02.24</b><br />
Prime numbers are interesting
</p>
</div>
</div>

<div id="outline-container-orgab10a1a" class="outline-3">
<h3 id="orgab10a1a"><span class="section-number-3">1.8</span> <a href="../Note/Tailrec.html">Tail recursion optimization translation</a></h3>
<div class="outline-text-3" id="text-1-8">
<p>
<b>2020.02.27</b><br />
Many algorithms can be expressed concisely and elegantly in functional languages with recursions.
However, not all languages support automatic optimizations respect to functional algorithms and,
some languages(such as <i>Scala</i>), although support basic <code>@tailrec</code> optimizations by code transformation,
they still can not do some agressive tailrec optimizations such as <code>CPS tailrec</code>.
</p>
</div>
</div>

<div id="outline-container-org8dfe619" class="outline-3">
<h3 id="org8dfe619"><span class="section-number-3">1.9</span> <a href="../Note/AgdaStudy.html">从零开始的Agda生活</a></h3>
<div class="outline-text-3" id="text-1-9">
<p>
<b>2020.03.01</b><br />
因为 <i>agda</i> 的国内使用者还很少，为了满足我的安利欲，我打算用中文写我的agda学习笔记与过程，希望可以在这个过程中获得新知的快乐。
Agda是一款依赖类型系统为核心的语言，所以支持形式化证明（实际上这也是agda的重要用途）。此外，agda的设计也十分有趣，无论是
混合前中后缀语法还是类Haskell的代码风格，都给予了玩家极大的自由。在agda的世界里，我们可以没有 <code>Integer</code> ，没有 <code>Bool</code> ,
但是我们却获得了创造一切的木头（没错，类似Minecraft）。在没有agda-stdlib的情况下，我们就需要自力更生，成为欢乐原始人或者，
成为 <b>创造神。</b>
</p>
</div>
</div>

<div id="outline-container-org810b11f" class="outline-3">
<h3 id="org810b11f"><span class="section-number-3">1.10</span> <a href="../Note/MIT6.828.lab1.html">MIT6.828 Lab1 </a></h3>
<div class="outline-text-3" id="text-1-10">
<p>
<b>2020.06.25</b><br />
To design a good OS is to create a great programming language.
</p>
</div>
</div>

<div id="outline-container-orgadc0e02" class="outline-3">
<h3 id="orgadc0e02"><span class="section-number-3">1.11</span> <a href="../Note/MIT6.828.hw.shell.html">MIT6.828 HW Shell</a></h3>
<div class="outline-text-3" id="text-1-11">
<p>
<b>2020.07.03</b> <br />
Shell is just a shell.
</p>
</div>
</div>

<div id="outline-container-org9895833" class="outline-3">
<h3 id="org9895833"><span class="section-number-3">1.12</span> <a href="../Note/MIT6.828.lab2.html">MIT6.828 Lab2</a></h3>
<div class="outline-text-3" id="text-1-12">
<p>
<b>2020.07.04</b><br />
Abstraction of space. 
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Comcx</p>
<p class="date">Created: 2020-07-04 Sat 23:33</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
